#pragma once

// Rocket League (1.31) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x4)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Constants
//---------------------------------------------------------------------------

#define CONST_MaxAirControlSensitivity                           10.f
#define CONST_MAX_REPLICATED_VOTERS                              8
#define CONST_TRADEHOLD_NONE                                     0
#define CONST_UnrealUnitsPerMeter                                100
#define CONST_MaxSteeringSensitivity                             10.f
#define CONST_TRADEHOLD_ALL                                      -1
#define CONST_BoostLevel_Active                                  1.0f
#define CONST_TRADEHOLD_P2P                                      -2
#define CONST_MaxFriendKeyLength                                 64
#define CONST_MaxLoadoutSets                                     50
#define CONST_BoostLevel_Activated                               0.0f
#define CONST_BoostLevel_Inactive                                -1.0f
#define CONST_PlayerCountIrrelevant                              "NO_COUNT"
#define CONST_TOUR_MATCH_NONE                                    -1
#define CONST_PriorityHigh                                       8
#define CONST_PriorityMed                                        4
#define CONST_PriorityLow                                        0
#define CONST_MAX_NAMEPLATES                                     8

//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum TAGame._AITypes_TA.EAITraitValue
enum class EAITraitValue : uint8_t
{
	AITraitValue_Low               = 0,
	AITraitValue_Medium            = 1,
	AITraitValue_High              = 2,
	AITraitValue_MAX               = 3
};


// Enum TAGame._AITypes_TA.EBTStatus
enum class EBTStatus : uint8_t
{
	BTStatus_Fail                  = 0,
	BTStatus_Success               = 1,
	BTStatus_Running               = 2,
	BTStatus_MAX                   = 3
};


// Enum TAGame._AITypes_TA.EAITeam
enum class EAITeam : uint8_t
{
	AITeam_Self                    = 0,
	AITeam_Enemy                   = 1,
	AITeam_Any                     = 2,
	AITeam_MAX                     = 3
};


// Enum TAGame._Types_TA.EExperimentalMapStatus
enum class EExperimentalMapStatus : uint8_t
{
	EMS_Default                    = 0,
	EMS_OnlyExperimentalPlaylist   = 1,
	EMS_Any                        = 2,
	EMS_MAX                        = 3
};


// Enum TAGame._Types_TA.EMirrorFieldType
enum class EMirrorFieldType : uint8_t
{
	MFT_None                       = 0,
	MFT_X                          = 1,
	MFT_Y                          = 2,
	MFT_XY                         = 3,
	MFT_TeamIndex                  = 4,
	MFT_MAX                        = 5
};


// Enum TAGame._Types_TA.EUIMenuState
enum class EUIMenuState : uint8_t
{
	UIMS_StartMenu                 = 0,
	UIMS_MainMenu                  = 1,
	UIMS_MAX                       = 2
};


// Enum TAGame._Types_TA.EChatChannel
enum class EChatChannel : uint8_t
{
	EChatChannel_Match             = 0,
	EChatChannel_Team              = 1,
	EChatChannel_Party             = 2,
	EChatChannel_Individual        = 3,
	EChatChannel_MAX               = 4
};


// Enum TAGame._Types_TA.ESkinType
enum class ESkinType : uint8_t
{
	EST_Default                    = 0,
	EST_Animated                   = 1,
	EST_AnimatedPrimaryOnly        = 2,
	EST_MAX                        = 3
};


// Enum TAGame._Types_TA.EKeySelection
enum class EKeySelection : uint8_t
{
	KS_Oldest                      = 0,
	KS_Newest                      = 1,
	KS_ShowKeyPicker               = 2,
	KS_MAX                         = 3
};


// Enum TAGame._Types_TA.EProductQuality
enum class EProductQuality : uint8_t
{
	EPQ_Common                     = 0,
	EPQ_Uncommon                   = 1,
	EPQ_Rare                       = 2,
	EPQ_VeryRare                   = 3,
	EPQ_Import                     = 4,
	EPQ_Exotic                     = 5,
	EPQ_BlackMarket                = 6,
	EPQ_Premium                    = 7,
	EPQ_Limited                    = 8,
	EPQ_MAX                        = 9
};


// Enum TAGame._Types_TA.EUnlockMethod
enum class EUnlockMethod : uint8_t
{
	UnlockMethod_Default           = 0,
	UnlockMethod_Drop              = 1,
	UnlockMethod_Special           = 2,
	UnlockMethod_Reward            = 3,
	UnlockMethod_DLC               = 4,
	UnlockMethod_Never             = 5,
	UnlockMethod_MAX               = 6
};


// Enum TAGame._Types_TA.EMatchTieBreaker
enum class EMatchTieBreaker : uint8_t
{
	MatchTieBreaker_FirstScore     = 0,
	MatchTieBreaker_Random         = 1,
	MatchTieBreaker_MAX            = 2
};


// Enum TAGame._Types_TA.EV2TutorialType
enum class EV2TutorialType : uint8_t
{
	V2T_Basic                      = 0,
	V2T_BasicAlt                   = 1,
	V2T_Advanced                   = 2,
	V2T_AdvancedDriving            = 3,
	V2T_AdvancedDoubleJump         = 4,
	V2T_AdvancedAerials            = 5,
	V2T_AdvancedSkills             = 6,
	V2T_BasicTeam                  = 7,
	V2T_AdvancedTeam               = 8,
	V2T_MAX                        = 9
};


// Enum TAGame._Types_TA.EGameplayMusicSetting
enum class EGameplayMusicSetting : uint8_t
{
	GameplayMusic_Off              = 0,
	GameplayMusic_TraningOnly      = 1,
	GameplayMusic_MatchesOnly      = 2,
	GameplayMusic_AlwaysOn         = 3,
	GameplayMusic_MAX              = 4
};


// Enum TAGame._Types_TA.ENameplateMode
enum class ENameplateMode : uint8_t
{
	NameplateMode_Default          = 0,
	NameplateMode_AlwaysVisible    = 1,
	NameplateMode_Simplified       = 2,
	NameplateMode_MAX              = 3
};


// Enum TAGame._Types_TA.EHUDMessageLevel
enum class EHUDMessageLevel : uint8_t
{
	HUDMessageLevel_All            = 0,
	HUDMessageLevel_GameUpdates    = 1,
	HUDMessageLevel_Essential      = 2,
	HUDMessageLevel_MAX            = 3
};


// Enum TAGame._Types_TA.EForceFeedbackType
enum class EForceFeedbackType : uint8_t
{
	ForceFeedbackType_Disabled     = 0,
	ForceFeedbackType_VeryLight    = 1,
	ForceFeedbackType_Light        = 2,
	ForceFeedbackType_Medium       = 3,
	ForceFeedbackType_Heavy        = 4,
	ForceFeedbackType_MAX          = 5
};


// Enum TAGame._Types_TA.ECameraSettingsPreset
enum class ECameraSettingsPreset : uint8_t
{
	CameraSettingsPreset_Default   = 0,
	CameraSettingsPreset_Balanced  = 1,
	CameraSettingsPreset_Wide      = 2,
	CameraSettingsPreset_Custom    = 3,
	CameraSettingsPreset_MAX       = 4
};


// Enum TAGame._Types_TA.EMTXCatalogCategory
enum class EMTXCatalogCategory : uint8_t
{
	MTX_None                       = 0,
	MTX_Keys                       = 1,
	MTX_EventCrates                = 2,
	MTX_MAX                        = 3
};


// Enum TAGame._Types_TA.ECurrency
enum class ECurrency : uint8_t
{
	Currency_Soft                  = 0,
	Currency_Hard                  = 1,
	Currency_MAX                   = 2
};


// Enum TAGame._Types_TA.EEquippableProductSlot
enum class EEquippableProductSlot : uint8_t
{
	EPS_Skin                       = 0,
	EPS_Wheels                     = 1,
	EPS_Boost                      = 2,
	EPS_Hat                        = 3,
	EPS_Antenna                    = 4,
	EPS_MAX                        = 5
};


// Enum TAGame._Types_TA.ETrinaryBool
enum class ETrinaryBool : uint8_t
{
	TrinaryBool_Irrelevant         = 0,
	TrinaryBool_False              = 1,
	TrinaryBool_True               = 2,
	TrinaryBool_MAX                = 3
};


// Enum TAGame._Types_TA.EPaintFinishType
enum class EPaintFinishType : uint8_t
{
	PaintFinishType_Standard       = 0,
	PaintFinishType_Metallic       = 1,
	PaintFinishType_MAX            = 2
};


// Enum TAGame._Types_TA.EPaintColorVariant
enum class EPaintColorVariant : uint8_t
{
	PaintColorVariant_Primary      = 0,
	PaintColorVariant_LightAccent  = 1,
	PaintColorVariant_DarkAccent   = 2,
	PaintColorVariant_Emissive     = 3,
	PaintColorVariant_MAX          = 4
};


// Enum TAGame._Types_TA.ECustomMatchSettingsType
enum class ECustomMatchSettingsType : uint8_t
{
	CustomMatchSettingsType_PrivateMatch = 0,
	CustomMatchSettingsType_LocalMatch = 1,
	CustomMatchSettingsType_TourCreate = 2,
	CustomMatchSettingsType_MAX    = 3
};


// Enum TAGame._Types_TA.EEditingType
enum class EEditingType : uint8_t
{
	ET_FreeCam                     = 0,
	ET_Ball                        = 1,
	ET_Car                         = 2,
	ET_MAX                         = 3
};


// Enum TAGame._Types_TA.EEquipAction
enum class EEquipAction : uint8_t
{
	EquipAction_Both               = 0,
	EquipAction_Team0              = 1,
	EquipAction_Team1              = 2,
	EquipAction_MAX                = 3
};


// Enum TAGame._Types_TA.EHistory
enum class EHistory : uint8_t
{
	H_None                         = 0,
	H_Add                          = 1,
	H_Remove                       = 2,
	H_MAX                          = 3
};


// Enum TAGame._Types_TA.EHistoryType
enum class EHistoryType : uint8_t
{
	HT_None                        = 0,
	HT_Undo                        = 1,
	HT_Redo                        = 2,
	HT_MAX                         = 3
};


// Enum TAGame._Types_TA.EPawnType
enum class EPawnType : uint8_t
{
	PT_Player                      = 0,
	PT_Spectator                   = 1,
	PT_Editor                      = 2,
	PT_MAX                         = 3
};


// Enum TAGame._Types_TA.ETrainingSaveType
enum class ETrainingSaveType : uint8_t
{
	ETS_MyTraining                 = 0,
	ETS_Favorited                  = 1,
	ETS_Downloaded                 = 2,
	ETS_MAX                        = 3
};


// Enum TAGame._Types_TA.ESaveGameResult
enum class ESaveGameResult : uint8_t
{
	SaveGameResult_Pending         = 0,
	SaveGameResult_Success         = 1,
	SaveGameResult_UserNotSignedIn = 2,
	SaveGameResult_Error           = 3,
	SaveGameResult_NoSpace         = 4,
	SaveGameResult_Corrupt         = 5,
	SaveGameResult_MAX             = 6
};


// Enum TAGame._Types_TA.EProductThumbnailSize
enum class EProductThumbnailSize : uint8_t
{
	PTS_Garage                     = 0,
	PTS_Drop                       = 1,
	PTS_Preview                    = 2,
	PTS_MAX                        = 3
};


// Enum TAGame._Types_TA.EProductAttachmentSocket
enum class EProductAttachmentSocket : uint8_t
{
	PAS_Hat                        = 0,
	PAS_Front                      = 1,
	PAS_Antenna                    = 2,
	PAS_UnderGlow                  = 3,
	PAS_Root                       = 4,
	PAS_MAX                        = 5
};


// Enum TAGame._Types_TA.ETAStatType
enum class ETAStatType : uint8_t
{
	StatType_Private               = 0,
	StatType_Unranked              = 1,
	StatType_Ranked                = 2,
	StatType_MAX                   = 3
};


// Enum TAGame._Types_TA.EBallHitType
enum class EBallHitType : uint8_t
{
	HitType_Item0                  = 0,
	HitType_Item1                  = 1,
	HitType_Item2                  = 2,
	HitType_Car                    = 3,
	HitType_MAX                    = 4
};


// Enum TAGame._Types_TA.EVoteStatus
enum class EVoteStatus : uint8_t
{
	VOTE_Pending                   = 0,
	VOTE_Yes                       = 1,
	VOTE_No                        = 2,
	VOTE_MAX                       = 3
};


// Enum TAGame._Types_TA.ETrainingTag
enum class ETrainingTag : uint8_t
{
	Tag_Aerials                    = 0,
	Tag_Bounces                    = 1,
	Tag_Shots                      = 2,
	Tag_Saves                      = 3,
	Tag_Clears                     = 4,
	Tag_Rebounds                   = 5,
	Tag_Redirects                  = 6,
	Tag_Freestyles                 = 7,
	Tag_Dribbles                   = 8,
	Tag_AirDribbles                = 9,
	Tag_Kickoffs                   = 10,
	Tag_WallShots                  = 11,
	Tag_LongShots                  = 12,
	Tag_CloseShots                 = 13,
	Tag_AngleShots                 = 14,
	Tag_BackwardsShots             = 15,
	Tag_Offense                    = 16,
	Tag_Defense                    = 17,
	Tag_PinchShots                 = 18,
	Tag_MAX                        = 19
};


// Enum TAGame._Types_TA.EDifficulty
enum class EDifficulty : uint8_t
{
	D_Easy                         = 0,
	D_Medium                       = 1,
	D_Hard                         = 2,
	D_MAX                          = 3
};


// Enum TAGame._Types_TA.ETrainingType
enum class ETrainingType : uint8_t
{
	Training_None                  = 0,
	Training_Aerial                = 1,
	Training_Goalie                = 2,
	Training_Striker               = 3,
	Training_MAX                   = 4
};


// Enum TAGame._Types_TA.ECarImpactResult
enum class ECarImpactResult : uint8_t
{
	CarImpactResult_None           = 0,
	CarImpactResult_ZeroSpeed      = 1,
	CarImpactResult_ZeroSpeedTowardsCar = 2,
	CarImpactResult_OtherCarFaster = 3,
	CarImpactResult_Success        = 4,
	CarImpactResult_SuccessAttachedBall = 5,
	CarImpactResult_FailDemolishTargetNone = 6,
	CarImpactResult_FailNotSupersonic = 7,
	CarImpactResult_FailInsufficientForwardSpeed = 8,
	CarImpactResult_FailNotWithinForwardEllipticalCone = 9,
	CarImpactResult_FailSameTeam   = 10,
	CarImpactResult_Bump           = 11,
	CarImpactResult_MAX            = 12
};


// Enum TAGame._Types_TA.EDemolishSpeed
enum class EDemolishSpeed : uint8_t
{
	DemolishSpeed_Supersonic       = 0,
	DemolishSpeed_None             = 1,
	DemolishSpeed_MAX              = 2
};


// Enum TAGame._Types_TA.EDemolishTarget
enum class EDemolishTarget : uint8_t
{
	DemolishTarget_OtherTeam       = 0,
	DemolishTarget_Everyone        = 1,
	DemolishTarget_None            = 2,
	DemolishTarget_MAX             = 3
};


// Enum TAGame._Types_TA.EProductFilterLogLevel
enum class EProductFilterLogLevel : uint8_t
{
	ProductFilterLogLevel_Filtered = 0,
	ProductFilterLogLevel_UnFiltered = 1,
	ProductFilterLogLevel_MAX      = 2
};


// Enum TAGame._Types_TA.EProductTradeRestriction
enum class EProductTradeRestriction : uint8_t
{
	ProductTradeRestriction_P2P    = 0,
	ProductTradeRestriction_TradeIn = 1,
	ProductTradeRestriction_MAX    = 2
};


// Enum TAGame._Types_TA.EProductFilterSortType
enum class EProductFilterSortType : uint8_t
{
	ProductFilterSortType_Alphabetical = 0,
	ProductFilterSortType_UnlockDate = 1,
	ProductFilterSortType_Quality  = 2,
	ProductFilterSortType_MAX      = 3
};


// Enum TAGame._Types_TA.EControllerSoundMode
enum class EControllerSoundMode : uint8_t
{
	CSM_Multiplayer                = 0,
	CSM_On                         = 1,
	CSM_Off                        = 2,
	CSM_MAX                        = 3
};


// Enum TAGame._Types_TA.EVoiceFilter
enum class EVoiceFilter : uint8_t
{
	VoiceFilter_All                = 0,
	VoiceFilter_Preset             = 1,
	VoiceFilter_TeamPreset         = 2,
	VoiceFilter_Team               = 3,
	VoiceFilter_Friends            = 4,
	VoiceFilter_None               = 5,
	VoiceFilter_MAX                = 6
};


// Enum TAGame._Types_TA.EPaintTeam
enum class EPaintTeam : uint8_t
{
	PaintTeam_Blue                 = 0,
	PaintTeam_Orange               = 1,
	PaintTeam_None                 = 2,
	PaintTeam_MAX                  = 3
};


// Enum TAGame._Types_TA.ETeam
enum class ETeam : uint8_t
{
	Team_Blue                      = 0,
	Team_Orange                    = 1,
	Team_MAX                       = 2
};


// Enum TAGame._Types_TA.SearchStatusOwner
enum class ESearchStatusOwner : uint8_t
{
	StatusOwner_None               = 0,
	StatusOwner_Matchmaking        = 1,
	StatusOwner_PrivateMatch       = 2,
	StatusOwner_Lan                = 3,
	StatusOwner_Tournaments        = 4,
	StatusOwner_MAX                = 5
};


// Enum TAGame._Types_TA.EMatchmakingViewTab
enum class EMatchmakingViewTab : uint8_t
{
	MatchmakingViewTab_Unranked    = 0,
	MatchmakingViewTab_Ranked      = 1,
	MatchmakingViewTab_MAX         = 2
};


// Enum TAGame._Types_TA.EWheelPosition
enum class EWheelPosition : uint8_t
{
	WP_FrontLeft                   = 0,
	WP_FrontRight                  = 1,
	WP_BackLeft                    = 2,
	WP_BackRight                   = 3,
	WP_MAX                         = 4
};


// Enum TAGame._Types_TA.ETernarySetting
enum class ETernarySetting : uint8_t
{
	TernarySetting_Default         = 0,
	TernarySetting_Enabled         = 1,
	TernarySetting_Disabled        = 2,
	TernarySetting_MAX             = 3
};


// Enum TAGame._Types_TA.ENetworkValue
enum class ENetworkValue : uint8_t
{
	Net_Low                        = 0,
	Net_Medium                     = 1,
	Net_High                       = 2,
	Net_MAX                        = 3
};


// Enum TAGame.AchievementManager_TA.EAchievementType
enum class EAchievementType : uint8_t
{
	AT_Game                        = 0,
	AT_EXP0                        = 1,
	AT_DLC0                        = 2,
	AT_DLC1                        = 3,
	AT_DLC2                        = 4,
	AT_XBO0                        = 5,
	AT_DLC3                        = 6,
	AT_DLC4                        = 7,
	AT_DLC5                        = 8,
	AT_DLC6                        = 9,
	AT_MAX                         = 10
};


// Enum TAGame.AchievementManager_TA.EAchievementGame
enum class EAchievementGame : uint8_t
{
	AG_Virtuoso                    = 0,
	AG_Stocked                     = 1,
	AG_FarFarAway                  = 2,
	AG_SuperVictorious             = 3,
	AG_Champion                    = 4,
	AG_TheStreak                   = 5,
	AG_HelensPride                 = 6,
	AG_BattleCarCollector          = 7,
	AG_DropsintheBucket            = 8,
	AG_Rocketeer                   = 9,
	AG_GreaseMonkey                = 10,
	AG_PitchVeteran                = 11,
	AG_RidersBlock                 = 12,
	AG_BreakShot                   = 13,
	AG_Turbocharger                = 14,
	AG_DrillSergeant               = 15,
	AG_MinutetoWinit               = 16,
	AG_SpeedDemon                  = 17,
	AG_PickMeUp                    = 18,
	AG_WallCrawler                 = 19,
	AG_TeamPlayer                  = 20,
	AG_SARPBCForever               = 21,
	AG_FeatherinYourRecap          = 22,
	AG_Winner                      = 23,
	AG_CleanSheet                  = 24,
	AG_TripleThreat                = 25,
	AG_DoubleUp                    = 26,
	AG_SinglesClub                 = 27,
	AG_PerfectStart                = 28,
	AG_StillAShowOff               = 29,
	AG_KnowTheDrill                = 30,
	AG_Traveler                    = 31,
	AG_Tinkerer                    = 32,
	AG_FirstTimer                  = 33,
	AG_BarrasBravas                = 34,
	AG_Friendly                    = 35,
	AG_MAX                         = 36
};


// Enum TAGame.AchievementManager_TA.EAchievementEXP0
enum class EAchievementEXP0 : uint8_t
{
	AEXP0_SkyHigh                  = 0,
	AEXP0_AllFours                 = 1,
	AEXP0_Gladiator                = 2,
	AEXP0_MAX                      = 3
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC0
enum class EAchievementDLC0 : uint8_t
{
	ADLC0_WinningIsWinning         = 0,
	ADLC0_AnInchAnd62Miles         = 1,
	ADLC0_RideOrDie                = 2,
	ADLC0_DontLookBack             = 3,
	ADLC0_FamilyNotFriends         = 4,
	ADLC0_DriftKing                = 5,
	ADLC0_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC1
enum class EAchievementDLC1 : uint8_t
{
	ADLC1_SurvivalOfTheFittest     = 0,
	ADLC1_Heartbreaker             = 1,
	ADLC1_NaturalProgression       = 2,
	ADLC1_Throwback                = 3,
	ADLC1_HotShotPartTwo           = 4,
	ADLC1_MAX                      = 5
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC2
enum class EAchievementDLC2 : uint8_t
{
	ADLC2_MyWorldIsFire            = 0,
	ADLC2_Spectacular              = 1,
	ADLC2_Savage                   = 2,
	ADLC2_Ruthless                 = 3,
	ADLC2_PsychoMasterExploder     = 4,
	ADLC2_MAX                      = 5
};


// Enum TAGame.AchievementManager_TA.EAchievementXBO0
enum class EAchievementXBO0 : uint8_t
{
	AXBO0_NiceHat                  = 0,
	AXBO0_MarcusVMasterChief       = 1,
	AXBO0_MAX                      = 2
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC6
enum class EAchievementDLC6 : uint8_t
{
	ADLC6_StormTrooper             = 0,
	ADLC6_GoodTimes                = 1,
	ADLC6_SwapMeet                 = 2,
	ADLC6_TradeSecret              = 3,
	ADLC6_RankUp                   = 4,
	ADLC6_ComingOnStrong           = 5,
	ADLC6_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC5
enum class EAchievementDLC5 : uint8_t
{
	ADLC5_RegisteredVoter          = 0,
	ADLC5_Metaverse                = 1,
	ADLC5_BraveTheElements         = 2,
	ADLC5_DamageControl            = 3,
	ADLC5_FullCourse               = 4,
	ADLC5_BuckminsterX10           = 5,
	ADLC5_MAX                      = 6
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC4
enum class EAchievementDLC4 : uint8_t
{
	ADLC4_GG                       = 0,
	ADLC4_Trifecta                 = 1,
	ADLC4_InfinitePower            = 2,
	ADLC4_StoppedCold              = 3,
	ADLC4_SeaTurtle                = 4,
	ADLC4_GetUpMrBubbles           = 5,
	ADLC4_RocketGenocider          = 6,
	ADLC4_MAX                      = 7
};


// Enum TAGame.AchievementManager_TA.EAchievementDLC3
enum class EAchievementDLC3 : uint8_t
{
	ADLC3_MadScientist             = 0,
	ADLC3_IcingTheCake             = 1,
	ADLC3_LeftWingRightWing        = 2,
	ADLC3_FastBreak                = 3,
	ADLC3_BuzzerBeater             = 4,
	ADLC3_BuddingArtist            = 5,
	ADLC3_OneBetter                = 6,
	ADLC3_Certifiable              = 7,
	ADLC3_MAX                      = 8
};


// Enum TAGame.ActivityFeedManager_TA.EActivityFeedType
enum class EActivityFeedType : uint8_t
{
	AF_UnlockedBody                = 0,
	AF_DrivenDistance              = 1,
	AF_ScoredGoal                  = 2,
	AF_BlockedShot                 = 3,
	AF_WonGame                     = 4,
	AF_MVPScore                    = 5,
	AF_DefeatedFriend              = 6,
	AF_CompletedRegularSeason      = 7,
	AF_WonChampionship             = 8,
	AF_UnlockedItem                = 9,
	AF_UnlockedSweetTooth          = 10,
	AF_MAX                         = 11
};


// Enum TAGame.PitchTekDrawingComponent_TA.EPitchTekDecalType
enum class EPitchTekDecalType : uint8_t
{
	PTDT_Ball                      = 0,
	PTDT_Car                       = 1,
	PTDT_MAX                       = 2
};


// Enum TAGame.BTLock.ELockScope
enum class ELockScope : uint8_t
{
	LockScope_Local                = 0,
	LockScope_Global               = 1,
	LockScope_MAX                  = 2
};


// Enum TAGame.CameraState_ReplayAutoCam_TA.ECountDownFocus
enum class ECountDownFocus : uint8_t
{
	CDF_None                       = 0,
	CDF_Pan                        = 1,
	CDF_Rotate                     = 2,
	CDF_MAX                        = 3
};


// Enum TAGame.ProductAsset_Body_TA.EForceProductsBehavior
enum class EForceProductsBehavior : uint8_t
{
	FPB_Licensed                   = 0,
	FPB_LicensedAll                = 1,
	FPB_All                        = 2,
	FPB_MAX                        = 3
};


// Enum TAGame.ClientConnectionTracker_TA.EConnectionQualityState
enum class EConnectionQualityState : uint8_t
{
	CQS_Good                       = 0,
	CQS_Mediocre                   = 1,
	CQS_Bad                        = 2,
	CQS_MAX                        = 3
};


// Enum TAGame.GameEvent_Tutorial_TA.ERotationType
enum class ERotationType : uint8_t
{
	Rot_Auto                       = 0,
	Rot_AutoAim                    = 1,
	Rot_AutoForward                = 2,
	Rot_AutoArch                   = 3,
	Rot_World                      = 4,
	Rot_MapCenter                  = 5,
	Rot_MAX                        = 6
};


// Enum TAGame.GFxData_LocalPlayer_TA.ESplitScreenPosition
enum class ESplitScreenPosition : uint8_t
{
	SSP_Center                     = 0,
	SSP_Left                       = 1,
	SSP_Right                      = 2,
	SSP_Top                        = 3,
	SSP_Bottom                     = 4,
	SSP_TopLeft                    = 5,
	SSP_TopRight                   = 6,
	SSP_BottomLeft                 = 7,
	SSP_BottomRight                = 8,
	SSP_MAX                        = 9
};


// Enum TAGame.GameplayMusicPlayer_TA.EMusicPlayerState
enum class EMusicPlayerState : uint8_t
{
	MusicPlayerState_None          = 0,
	MusicPlayerState_Enabled       = 1,
	MusicPlayerState_Muted         = 2,
	MusicPlayerState_Disabled      = 3,
	MusicPlayerState_MAX           = 4
};


// Enum TAGame.GameplayMusicPlayer_TA.EPlaylistType
enum class EPlaylistType : uint8_t
{
	PlaylistType_Training          = 0,
	PlaylistType_Match             = 1,
	PlaylistType_MAX               = 2
};


// Enum TAGame.GFxData_OnlineMatchStatus_TA.SearchMessageType
enum class ESearchMessageType : uint8_t
{
	MessageType_Status             = 0,
	MessageType_Warning            = 1,
	MessageType_MAX                = 2
};


// Enum TAGame.GFxData_Party_TA.EPsyNetPartyStatus
enum class EPsyNetPartyStatus : uint8_t
{
	PsyNetParty_Disabled           = 0,
	PsyNetParty_Connecting         = 1,
	PsyNetParty_Connected          = 2,
	PsyNetParty_Disconnected       = 3,
	PsyNetParty_MAX                = 4
};


// Enum TAGame.GFxData_UserSetting_TA.EUserSettingType
enum class EUserSettingType : uint8_t
{
	UserSettingType_List           = 0,
	UserSettingType_Boolean        = 1,
	UserSettingType_Scalar         = 2,
	UserSettingType_MAX            = 3
};


// Enum TAGame.GFxEngine_TA.ESoundStatePriority
enum class ESoundStatePriority : uint8_t
{
	SSP_None                       = 0,
	SSP_Scoreboard                 = 1,
	SSP_Replay                     = 2,
	SSP_Pause                      = 3,
	SSP_BeginRound                 = 4,
	SSP_EndRound                   = 5,
	SSP_WinnerMenu                 = 6,
	SSP_MAX                        = 7
};


// Enum TAGame.ProductAsset_Wheel_TA.EMeshMirrorMode
enum class EMeshMirrorMode : uint8_t
{
	MeshMirrorMode_Mirror          = 0,
	MeshMirrorMode_Rotate          = 1,
	MeshMirrorMode_MAX             = 2
};


// Enum TAGame._TourTypes_TA.ETourSeedType
enum class ETourSeedType : uint8_t
{
	TourSeedType_Skill             = 0,
	TourSeedType_Random            = 1,
	TourSeedType_MAX               = 2
};


// Enum TAGame.Replay_TA.EReplayVersion
enum class EReplayVersion : uint8_t
{
	ReplayVersion_Base             = 0,
	ReplayVersion_OnlineLoadout    = 1,
	ReplayVersion_CameraSettings   = 2,
	ReplayVersion_TeamLoadouts     = 3,
	ReplayVersion_MatchType        = 4,
	ReplayVersion_ActorName        = 5,
	ReplayVersion_MutatorSeekFree  = 6,
	ReplayVersion_ClubColors       = 7,
	ReplayVersion_MAX              = 8
};


// Enum TAGame.Replay_TA.EReplayState
enum class EReplayState : uint8_t
{
	ReplayState_Idle               = 0,
	ReplayState_Recording          = 1,
	ReplayState_Playing            = 2,
	ReplayState_MAX                = 3
};


// Enum TAGame.SkelControlSingleBoneCopy_TA.ECopyAxis
enum class ECopyAxis : uint8_t
{
	CopyAxis_X                     = 0,
	CopyAxis_Y                     = 1,
	CopyAxis_Z                     = 2,
	CopyAxis_Pitch                 = 3,
	CopyAxis_Yaw                   = 4,
	CopyAxis_Roll                  = 5,
	CopyAxis_MAX                   = 6
};


// Enum TAGame.Tutorial_TA.ETutorialOutput
enum class ETutorialOutput : uint8_t
{
	TutorialOutput_Ended           = 0,
	TutorialOutput_Completed       = 1,
	TutorialOutput_Failed          = 2,
	TutorialOutput_ScreenFadedIn   = 3,
	TutorialOutput_ScreenFadedOut  = 4,
	TutorialOutput_AllMessagesDisplayed = 5,
	TutorialOutput_Started         = 6,
	TutorialOutput_Reset           = 7,
	TutorialOutput_Skipped         = 8,
	TutorialOutput_MAX             = 9
};


// Enum TAGame.Tutorial_TA.ETutorialStatus
enum class ETutorialStatus : uint8_t
{
	TutorialStatus_None            = 0,
	TutorialStatus_Failed          = 1,
	TutorialStatus_Completed       = 2,
	TutorialStatus_MAX             = 3
};


// Enum TAGame.Tutorial_TA.EPlayerDriveType
enum class EPlayerDriveType : uint8_t
{
	PlayerDriveType_All            = 0,
	PlayerDriveType_Player         = 1,
	PlayerDriveType_Bot            = 2,
	PlayerDriveType_MAX            = 3
};


// Enum TAGame.BreakOutActor_Platform_TA.EBreakoutDamageState
enum class EBreakoutDamageState : uint8_t
{
	DamageState_Start              = 0,
	DamageState_Damaged            = 1,
	DamageState_Broken             = 2,
	DamageState_MAX                = 3
};


// Enum TAGame.SpecialPickup_BallFreeze_TA.BallFreezeState
enum class EBallFreezeState : uint8_t
{
	BallFreezeState_Freezing       = 0,
	BallFreezeState_Frozen         = 1,
	BallFreezeState_MAX            = 2
};


// Enum TAGame.SpecialPickup_GrapplingHook_TA.ERopeState
enum class ERopeState : uint8_t
{
	RopeState_Traveling            = 0,
	RopeState_Attached             = 1,
	RopeState_MAX                  = 2
};


// Enum TAGame.SpecialPickup_Spring_TA.ESpringState
enum class ESpringState : uint8_t
{
	SpringState_Traveling          = 0,
	SpringState_PostHit            = 1,
	SpringState_MAX                = 2
};


// Enum TAGame.DistributionFloatSpeed_TA.ESpeedDistributionSpace
enum class ESpeedDistributionSpace : uint8_t
{
	SDD_Forward                    = 0,
	SDD_Side                       = 1,
	SDD_Up                         = 2,
	SDD_World                      = 3,
	SDD_MAX                        = 4
};


// Enum TAGame.ForceVolume_TA.EForceDirection
enum class EForceDirection : uint8_t
{
	EFD_VolumeRotation             = 0,
	EFD_ActorVelocity              = 1,
	EFD_Custom                     = 2,
	EFD_MAX                        = 3
};


// Enum TAGame.InterpTrackSkelControlRotation_TA.ERotationAxis
enum class ERotationAxis : uint8_t
{
	ROTAXIS_Yaw                    = 0,
	ROTAXIS_Pitch                  = 1,
	ROTAXIS_Roll                   = 2,
	ROTAXIS_MAX                    = 3
};


// Enum TAGame.PlayerVanitySet_TA.EVanityType
enum class EVanityType : uint8_t
{
	VT_None                        = 0,
	VT_Banner                      = 1,
	VT_Avatar                      = 2,
	VT_Border                      = 3,
	VT_MAX                         = 4
};


// Enum TAGame.ProductAttribute_LicenseGroup_TA.ELicenseGroup
enum class ELicenseGroup : uint8_t
{
	LicenseGroup_Default           = 0,
	LicenseGroup_Mario             = 1,
	LicenseGroup_Berry             = 2,
	LicenseGroup_MAX               = 3
};


// Enum TAGame.SaveDataVersions_TA.ESaveDataVersion
enum class ESaveDataVersion : uint8_t
{
	SaveDataVersion_Initial        = 0,
	SaveDataVersion_LightShafts    = 1,
	SaveDataVersion_NewOnlineProductsRemoved = 2,
	SaveDataVersion_Invisitek      = 3,
	SaveDataVersion_SoundSettings  = 4,
	SaveDataVersion_UISavedValues  = 5,
	SaveDataVersion_MapPrefs       = 6,
	SaveDataVersion_GarageComplex  = 7,
	SaveDataVersion_RankedReconnect = 8,
	SaveDataVersion_Network        = 9,
	SaveDataVersion_Achievements   = 10,
	SaveDataVersion_Tutorial       = 11,
	SaveDataVersion_BlogTiles      = 12,
	SaveDataVersion_Products       = 13,
	SaveDataVersion_PlaylistSkillData = 14,
	SaveDataVersion_MatchmakingSettings = 15,
	SaveDataVersion_ClientXP       = 16,
	SaveDataVersion_TournamentSettings = 17,
	SaveDataVersion_Seasons        = 18,
	SaveDataVersion_VideoSettings  = 19,
	SaveDataVersion_GameplaySettings = 20,
	SaveDataVersion_CustomMatchSettings = 21,
	SaveDataVersion_FreeplayMap    = 22,
	SaveDataVersion_SaveSingleSeason = 23,
	SaveDataVersion_MAX            = 24
};


// Enum TAGame._CrowdTypes_TA.ECrowdValueType
enum class ECrowdValueType : uint8_t
{
	CVT_Excitement                 = 0,
	CVT_Tension                    = 1,
	CVT_Anticipation               = 2,
	CVT_Upset                      = 3,
	CVT_MAX                        = 4
};


// Enum TAGame.ProductAttribute_Trademark_TA.ETrademarkGlyph
enum class ETrademarkGlyph : uint8_t
{
	TrademarkGlyph_TradeMark       = 0,
	TrademarkGlyph_Registered      = 1,
	TrademarkGlyph_Copyright       = 2,
	TrademarkGlyph_MAX             = 3
};


// Enum TAGame.StatTitle_TA.EStatTrackingUnitType
enum class EStatTrackingUnitType : uint8_t
{
	CountUnit                      = 0,
	SpeedUnit                      = 1,
	DistanceUnit                   = 2,
	EStatTrackingUnitType_MAX      = 3
};


// Enum TAGame.ProfileVersions_TA.EProfileVersion
enum class EProfileVersion : uint8_t
{
	ProfileVersion_Initial         = 0,
	ProfileVersion_LoadoutPlayerTitle = 1,
	ProfileVersion_SaveReplayInput = 2,
	ProfileVersion_SaveReplayInput2 = 3,
	ProfileVersion_ChatRebind      = 4,
	ProfileVersion_SaveReplayInput3 = 5,
	ProfileVersion_DingoChatFix    = 6,
	ProfileVersion_CustomMatchSettings = 7,
	ProfileVersion_ChatSettings    = 8,
	ProfileVersion_TeamLoadouts    = 9,
	ProfileVersion_CarColors       = 10,
	ProfileVersion_ChatGamepadBindingConsoleOnly = 11,
	ProfileVersion_PaintFinishInLoadouts = 12,
	ProfileVersion_MusicPlaylistSelector = 13,
	ProfileVersion_ResetAccountSelectNNX = 14,
	ProfileVersion_GameplaySettings = 15,
	ProfileVersion_ResetAccountSelectNNXMain = 16,
	ProfileVersion_BannerSettings  = 17,
	ProfileVersion_Stats           = 18,
	ProfileVersion_ControlSettings = 19,
	ProfileVersion_PCBindings      = 20,
	ProfileVersion_AimAssist       = 21,
	ProfileVersion_CameraSettings  = 22,
	ProfileVersion_QuickChatSettings = 23,
	ProfileVersion_LoadoutData     = 24,
	ProfileVersion_GamepadSettings = 25,
	ProfileVersion_SparseBindingsArrays = 26,
	ProfileVersion_ClubColors2     = 27,
	ProfileVersion_CarColors2      = 28,
	ProfileVersion_MAX             = 29
};


// Enum TAGame.TourStatus_TA.ETourStatus
enum class ETourStatus : uint8_t
{
	TourStatus_None                = 0,
	TourStatus_Cancelled           = 1,
	TourStatus_MAX                 = 2
};


// Enum TAGame.GameEditor_Ring_TA.EDetectionType
enum class EDetectionType : uint8_t
{
	DT_Ball                        = 0,
	DT_Player                      = 1,
	DT_MAX                         = 2
};


// Enum TAGame.GameEvent_TrainingEditor_TA.EPlayTestType
enum class EPlayTestType : uint8_t
{
	PlayTest_LoopRound             = 0,
	PlayTest_IncrementRound        = 1,
	PlayTest_IncrementRoundLoop    = 2,
	PlayTest_MAX                   = 3
};


// Enum TAGame.MenuSequencer_TA.ESequenceStatus
enum class ESequenceStatus : uint8_t
{
	SS_Idle                        = 0,
	SS_Entering                    = 1,
	SS_Leaving                     = 2,
	SS_Pending                     = 3,
	SS_MAX                         = 4
};


// Enum TAGame.CameraStateSelector_Priority_TA.EStatePriority
enum class EStatePriority : uint8_t
{
	SP_Default                     = 0,
	SP_OverrideAny                 = 1,
	SP_OverrideLower               = 2,
	SP_InitialOnly                 = 3,
	SP_MAX                         = 4
};


// Enum TAGame.CameraState_DirectorMoving_TA.ECameraLoopType
enum class ECameraLoopType : uint8_t
{
	CLT_StopAtEnd                  = 0,
	CLT_PingPong                   = 1,
	CLT_Loop                       = 2,
	CLT_MAX                        = 3
};


// Enum TAGame.GFxData_MapPrefs_TA.EMapPrefType
enum class EMapPrefType : uint8_t
{
	MapPrefType_None               = 0,
	MapPrefType_Like               = 1,
	MapPrefType_Dislike            = 2,
	MapPrefType_MAX                = 3
};


// Enum TAGame.GFxData_ProductFilter_TA.EProductFilterType
enum class EProductFilterType : uint8_t
{
	ProductFilterType_TradeIn      = 0,
	ProductFilterType_P2P          = 1,
	ProductFilterType_Garage       = 2,
	ProductFilterType_MAX          = 3
};


// Enum TAGame.GFxData_ProductFilter_TA.EFilterProductAttribute
enum class EFilterProductAttribute : uint8_t
{
	FPA_Indestructible             = 0,
	FPA_MAX                        = 1
};


// Enum TAGame.SpecialEventConfig_TA.ESpecialEventState
enum class ESpecialEventState : uint8_t
{
	SES_Inactive                   = 0,
	SES_Active                     = 1,
	SES_Redemption                 = 2,
	SES_MAX                        = 3
};


// Enum TAGame.GFxData_TourEvent_TA.ETourEventStatus
enum class ETourEventStatus : uint8_t
{
	TES_NonePending                = 0,
	TES_Registered                 = 1,
	TES_CheckInOpen                = 2,
	TES_CheckedIn                  = 3,
	TES_GeneratingBrackets         = 4,
	TES_MatchPending               = 5,
	TES_MatchReady                 = 6,
	TES_InMatch                    = 7,
	TES_MatchResultsPending        = 8,
	TES_Paused                     = 9,
	TES_MAX                        = 10
};


// Enum TAGame.GFxData_TrainingModeBrowser_TA.ETrainingModeSearchTypes
enum class ETrainingModeSearchTypes : uint8_t
{
	TMST_AllPublic                 = 0,
	TMST_FeaturedOnly              = 1,
	TMST_MAX                       = 2
};


// Enum TAGame.GFxData_UnlockNotification_TA.EUnlockType
enum class EUnlockType : uint8_t
{
	UnlockType_AchievementUnlocked = 0,
	UnlockType_ChallengeActive     = 1,
	UnlockType_ChallengeUnlocked   = 2,
	UnlockType_MAX                 = 3
};


// Enum TAGame.SeqAct_CheckRotationAngle_TA.ECheckAxis
enum class ECheckAxis : uint8_t
{
	ECA_Pitch                      = 0,
	ECA_Yaw                        = 1,
	ECA_Roll                       = 2,
	ECA_MAX                        = 3
};


// Enum TAGame.StaticMeshRBActor_TA.EApplyForceTo
enum class EApplyForceTo : uint8_t
{
	EAF_None                       = 0,
	EAF_Any                        = 1,
	EAF_CarOnly                    = 2,
	EAF_BallOnly                   = 3,
	EAF_MAX                        = 4
};


// Enum TAGame.TMetricsShared_TA.EDisconnect
enum class EDisconnect : uint8_t
{
	EDisconnect_Timeout            = 0,
	EDisconnect_Kick               = 1,
	EDisconnect_GameFull           = 2,
	EDisconnect_MAX                = 3
};


// Enum TAGame.TMetricsShared_TA.EMatchType
enum class EMatchType : uint8_t
{
	EmatchType_Online              = 0,
	EMatchType_Private             = 1,
	EMatchType_Offline             = 2,
	EMatchType_MAX                 = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct TAGame._Types_TA.ClientLoadoutData
// 0x000C
struct FClientLoadoutData
{
	TArray<int>                                        Products;                                                 // 0x0000(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamColor
// 0x0008
struct FLoadoutTeamColor
{
	unsigned char                                      Team;                                                     // 0x0000(0x0001)
	unsigned char                                      TeamColorID;                                              // 0x0001(0x0001)
	unsigned char                                      CustomColorID;                                            // 0x0002(0x0001)
	unsigned char                                      UnknownData00[0x1];                                       // 0x0003(0x0001) MISSED OFFSET
	unsigned long                                      bSet : 1;                                                 // 0x0004(0x0004)
};

// ScriptStruct TAGame._Types_TA.LoadoutTeamPaint
// 0x0008 (0x0010 - 0x0008)
struct FLoadoutTeamPaint : public FLoadoutTeamColor
{
	int                                                TeamFinishID;                                             // 0x0008(0x0004)
	int                                                CustomFinishID;                                           // 0x000C(0x0004)
};

// ScriptStruct TAGame._Types_TA.LoadoutData
// 0x0028 (0x0034 - 0x000C)
struct U_Types_TA_FLoadoutData : public FClientLoadoutData
{
	struct FLoadoutTeamPaint                           TeamPaint;                                                // 0x000C(0x0010)
	struct FName                                       Title;                                                    // 0x001C(0x0008)
	int                                                TeamIndex;                                                // 0x0024(0x0004)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0028(0x000C) UNKNOWN PROPERTY: ArrayProperty TAGame._Types_TA.LoadoutData.OnlineProducts
};

// ScriptStruct TAGame._Types_TA.GFxTeamColor
// 0x0010
struct FGFxTeamColor
{
	int                                                Value;                                                    // 0x0000(0x0004) (CPF_DataBinding)
	int                                                ColorID;                                                  // 0x0004(0x0004) (CPF_DataBinding)
	int                                                X;                                                        // 0x0008(0x0004) (CPF_DataBinding)
	int                                                Y;                                                        // 0x000C(0x0004) (CPF_DataBinding)
};

// ScriptStruct TAGame._Types_TA.InputRate
// 0x0008
struct FInputRate
{
	float                                              RiseRate;                                                 // 0x0000(0x0004) (CPF_Edit)
	float                                              FallRate;                                                 // 0x0004(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame._Types_TA.MapImageLoadResult
// 0x000C
struct FMapImageLoadResult
{
	class UTexture2D*                                  Image;                                                    // 0x0000(0x0004)
	struct FName                                       MapName;                                                  // 0x0004(0x0008)
};

// ScriptStruct TAGame._Types_TA.ProductThumbnailResult
// 0x000C
struct FProductThumbnailResult
{
	class UProductAsset_TA*                            Asset;                                                    // 0x0000(0x0004)
	class UOnlineProduct_TA*                           OnlineProduct;                                            // 0x0004(0x0004)
	class UProductThumbnail_TA*                        Thumbnail;                                                // 0x0008(0x0004)
};

// ScriptStruct TAGame._Types_TA.AssetLoadResult
// 0x0014
struct FAssetLoadResult
{
	int                                                ProductID;                                                // 0x0000(0x0004)
	struct FName                                       AssetName;                                                // 0x0004(0x0008)
	class UProductAsset_TA*                            Asset;                                                    // 0x000C(0x0004)
	class UProductThumbnailAsset_TA*                   ThumbnailAsset;                                           // 0x0010(0x0004)
};

// ScriptStruct TAGame._Types_TA.RandomWeight
// 0x000C
struct FRandomWeight
{
	class UObject*                                     Obj;                                                      // 0x0000(0x0004)
	float                                              Weight;                                                   // 0x0004(0x0004)
	float                                              OrigWeight;                                               // 0x0008(0x0004)
};

// ScriptStruct TAGame._Types_TA.VehicleInputs
// 0x0020
struct FVehicleInputs
{
	float                                              Throttle;                                                 // 0x0000(0x0004) (CPF_Edit)
	float                                              Steer;                                                    // 0x0004(0x0004) (CPF_Edit)
	float                                              Pitch;                                                    // 0x0008(0x0004) (CPF_Edit)
	float                                              Yaw;                                                      // 0x000C(0x0004) (CPF_Edit)
	float                                              Roll;                                                     // 0x0010(0x0004) (CPF_Edit)
	float                                              DodgeForward;                                             // 0x0014(0x0004) (CPF_Edit)
	float                                              DodgeStrafe;                                              // 0x0018(0x0004) (CPF_Edit)
	unsigned long                                      bJump : 1;                                                // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bActivateBoost : 1;                                       // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bHoldingBoost : 1;                                        // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bHandbrake : 1;                                           // 0x001C(0x0004) (CPF_Edit)
	unsigned long                                      bJumped : 1;                                              // 0x001C(0x0004)
};

// ScriptStruct TAGame._AITypes_TA.BTProxyData
// 0x0040
struct FBTProxyData
{
	struct FVector                                     Location;                                                 // 0x0000(0x000C)
	struct FVector                                     Velocity;                                                 // 0x000C(0x000C)
	struct FVector                                     Gravity;                                                  // 0x0018(0x000C)
	struct FRotator                                    Rotation;                                                 // 0x0024(0x000C)
	float                                              Radius;                                                   // 0x0030(0x0004)
	float                                              Bounce;                                                   // 0x0034(0x0004)
	class AActor*                                      Actor;                                                    // 0x0038(0x0004)
	class AVehicle_TA*                                 Vehicle;                                                  // 0x003C(0x0004)
};

// ScriptStruct TAGame._AITypes_TA.AITraits
// 0x0007
struct FAITraits
{
	class UAIRole_TA*                                  Role;                                                     // 0x0000(0x0004) (CPF_Edit)
	TEnumAsByte<EAITraitValue>                         Aggression;                                               // 0x0004(0x0001) (CPF_Edit)
	TEnumAsByte<EAITraitValue>                         Hostility;                                                // 0x0005(0x0001) (CPF_Edit)
	TEnumAsByte<EAITraitValue>                         Airplay;                                                  // 0x0006(0x0001) (CPF_Edit)
};

// ScriptStruct TAGame._AITypes_TA.BTDynamicLinkData
// 0x000C
struct FBTDynamicLinkData
{
	struct FName                                       LinkName;                                                 // 0x0000(0x0008) (CPF_Edit)
	class UBTNode*                                     Node;                                                     // 0x0008(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame._Types_TA.DemolishData
// 0x0020
struct FDemolishData
{
	class ARBActor_TA*                                 Attacker;                                                 // 0x0000(0x0004)
	class ACar_TA*                                     Victim;                                                   // 0x0004(0x0004)
	struct FVector                                     AttackerVelocity;                                         // 0x0008(0x000C)
	struct FVector                                     VictimVelocity;                                           // 0x0014(0x000C)
};

// ScriptStruct TAGame.AIController_TA.SkillRange
// 0x000C
struct FSkillRange
{
	float                                              Easy;                                                     // 0x0000(0x0004) (CPF_Edit)
	float                                              Hard;                                                     // 0x0004(0x0004) (CPF_Edit)
	float                                              Value;                                                    // 0x0008(0x0004) (CPF_Transient)
};

// ScriptStruct TAGame._AITypes_TA.NamedEvent
// 0x0010
struct FNamedEvent
{
	struct FName                                       EventName;                                                // 0x0000(0x0008)
	class AActor*                                      Sender;                                                   // 0x0008(0x0004)
	float                                              RadiusSq;                                                 // 0x000C(0x0004)
};

// ScriptStruct TAGame.AIController_TA.CachedProxyData
// 0x004C
struct FCachedProxyData
{
	class UBTProxyType*                                Type;                                                     // 0x0000(0x0004)
	int                                                Index;                                                    // 0x0004(0x0004)
	struct FBTProxyData                                Data;                                                     // 0x0008(0x0040)
	float                                              CacheTime;                                                // 0x0048(0x0004)
};

// ScriptStruct TAGame.AIController_TA.CachedTargetData
// 0x004C
struct FCachedTargetData
{
	class UBTTarget*                                   Target;                                                   // 0x0000(0x0004)
	int                                                Index;                                                    // 0x0004(0x0004)
	struct FBTProxyData                                Data;                                                     // 0x0008(0x0040)
	float                                              CacheTime;                                                // 0x0048(0x0004)
};

// ScriptStruct TAGame.AIController_TA.CachedObstaclePoly
// 0x0020
struct FCachedObstaclePoly
{
	struct FPointer                                    Poly;                                                     // 0x0000(0x0004) (CPF_Native)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
	struct FPlane                                      Plane;                                                    // 0x0010(0x0010)
};

// ScriptStruct TAGame.AIController_TA.CachedObstaclesData
// 0x0024
struct FCachedObstaclesData
{
	struct FVector                                     CarLocation;                                              // 0x0000(0x000C)
	struct FVector                                     CarNavMeshLocation;                                       // 0x000C(0x000C)
	TArray<struct FCachedObstaclePoly>                 Polys;                                                    // 0x0018(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._AITypes_TA.AICachedGoalInfo
// 0x0010
struct FAICachedGoalInfo
{
	class UGoal_TA*                                    Goal;                                                     // 0x0000(0x0004) (CPF_ExportObject, CPF_Component, CPF_EditInline)
	struct FVector                                     FieldSize;                                                // 0x0004(0x000C)
};

// ScriptStruct TAGame.AIManager_TA.CachedNavMeshLocation
// 0x001C
struct FCachedNavMeshLocation
{
	class AActor*                                      Actor;                                                    // 0x0000(0x0004)
	struct FVector                                     NavMeshLocation;                                          // 0x0004(0x000C)
	struct FVector                                     OldActorLocation;                                         // 0x0010(0x000C)
};

// ScriptStruct TAGame.ArenaSoundSettings_TA.ArenaStatSound
// 0x0008
struct FArenaStatSound
{
	class UStatEvent_TA*                               StatEvent;                                                // 0x0000(0x0004) (CPF_Edit, CPF_EditConst)
	class UAkSoundCue*                                 Sound;                                                    // 0x0004(0x0004) (CPF_Edit)
};

// ScriptStruct TAGame.AssetProfiler_TA.AssetProfile
// 0x0050
struct FAssetProfile
{
	class UProductAsset_TA*                            Asset;                                                    // 0x0000(0x0004)
	struct FRenderProfile                              RenderTimeTotal;                                          // 0x0004(0x0024)
	struct FRenderProfile                              RenderTimePerAsset;                                       // 0x0028(0x0024)
	int                                                AssetCount;                                               // 0x004C(0x0004)
};

// ScriptStruct TAGame._Types_TA.CurrencyDrop
// 0x0008
struct FCurrencyDrop
{
	int                                                CurrencyID;                                               // 0x0000(0x0004)
	int                                                Amount;                                                   // 0x0004(0x0004)
};

// ScriptStruct TAGame._TourTypes_TA.TourMatchGame
// 0x0014
struct FTourMatchGame
{
	int                                                GameTimeSeconds;                                          // 0x0000(0x0004)
	unsigned long                                      bOverTime : 1;                                            // 0x0004(0x0004)
	int                                                Winner;                                                   // 0x0008(0x0004)
	int                                                Scores[0x2];                                              // 0x000C(0x0004)
};

// ScriptStruct TAGame._TourTypes_TA.TourMatch
// 0x001C
struct FTourMatch
{
	int                                                MatchID;                                                  // 0x0000(0x0004)
	int                                                Teams[0x2];                                               // 0x0004(0x0004)
	int                                                Winner;                                                   // 0x000C(0x0004)
	TArray<struct FTourMatchGame>                      Games;                                                    // 0x0010(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ReportPlayerData
// 0x0054
struct FReportPlayerData
{
	struct FUniqueNetId                                PlayerID;                                                 // 0x0000(0x0048)
	struct FString                                     PlayerName;                                               // 0x0048(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ReportedPlayerInfo
// 0x00B0
struct FReportedPlayerInfo
{
	struct FReportPlayerData                           Reporter;                                                 // 0x0000(0x0054) (CPF_NeedCtorLink)
	struct FReportPlayerData                           Offender;                                                 // 0x0054(0x0054) (CPF_NeedCtorLink)
	unsigned char                                      ReasonID;                                                 // 0x00A8(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00A9(0x0003) MISSED OFFSET
	float                                              ReportTimeStamp;                                          // 0x00AC(0x0004)
};

// ScriptStruct TAGame.PlayerController_TA.ChatSpamData
// 0x0018
struct FChatSpamData
{
	float                                              RiseAmount;                                               // 0x0000(0x0004) (CPF_Edit)
	float                                              RiseMultiplier;                                           // 0x0004(0x0004) (CPF_Edit)
	float                                              DecayRate;                                                // 0x0008(0x0004) (CPF_Edit)
	float                                              MaxValue;                                                 // 0x000C(0x0004) (CPF_Edit)
	float                                              Value;                                                    // 0x0010(0x0004)
	float                                              LastChatTime;                                             // 0x0014(0x0004)
};

// ScriptStruct TAGame._Types_TA.MessageValue
// 0x0020
struct FMessageValue
{
	struct FString                                     StringValue;                                              // 0x0000(0x000C) (CPF_NeedCtorLink)
	int                                                IntValue;                                                 // 0x000C(0x0004)
	class UObject*                                     ObjectValue;                                              // 0x0010(0x0004)
	struct FName                                       NameValue;                                                // 0x0014(0x0008)
	int                                                ValueType;                                                // 0x001C(0x0004)
};

// ScriptStruct TAGame._Types_TA.MessagePacket
// 0x0010
struct FMessagePacket
{
	class UMessage_TA*                                 Message;                                                  // 0x0000(0x0004) (CPF_Const)
	TArray<struct FMessageValue>                       Values;                                                   // 0x0004(0x000C) (CPF_Const, CPF_NeedCtorLink)
};

// ScriptStruct TAGame._Types_TA.ClientFrameData
// 0x0028
struct FClientFrameData
{
	struct FVehicleInputs                              VehicleInput;                                             // 0x0000(0x0020)
	int                                                frame;                                                    // 0x0020(0x0004)
	float                                              TimeStamp;                                                // 0x0024(0x0004)
};

// ScriptStruct TAGame.PlayerController_TA.ClientPacketData
// 0x0028
struct FClientPacketData
{
	float                                              TimeStamp;                                                // 0x0000(0x0004)
	struct FVector                                     CameraLoc;                                                // 0x0004(0x000C)
	struct FRotator                                    CameraRot;                                                // 0x0010(0x000C)
	TArray<struct FClientFrameData>                    Frames;                                                   // 0x001C(0x000C) (CPF_NeedCtorLink)
};

// ScriptStruct TAGame.PlayerController_TA.ClientData
// 0x0040
struct FClientData
{
	TArray<struct FClientFrameData>                    InputFrames;                                              // 0x0000(0x000C) (CPF_NeedCtorLink)
	int                                                LastProcessedFrame;                                       // 0x000C(0x0004)
	int                                                LastProcessedReceivedFrame;                               // 0x0010(0x0004)
	float                                              LastInputTime;                                            // 0x0014(0x0004)
	float                                              InputTimeMu;                                              // 0x0018(0x0004)
	float                                              InputTimeVariance;                                        // 0x001C(0x0004)
	int                                                InputBufferSize;                                          // 0x0020(0x0004)
	float                                              InputBufferTime;                                          // 0x0024(0x0004)
	unsigned long                                      bFillingBuffer : 1;                                       // 0x0028(0x0004)
	float                                              PrevInputBufferTime;                                      // 0x002C(0x0004)
	float                                              TimeLastMissedInput;                                      // 0x0030(0x0004)
	float                                              TimeLastSimTimeAdjustment;                                // 0x0034(0x0004)
